let listBtn = document.querySelector('.list-btn');
let header = document.querySelector('header')
let headerHidden = true;
let container = document.querySelector("div.container");
// اذكار الصباح
let dayZekr = [
    "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]",
    "قُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)",
    "قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
    "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)",
    "أصبحنا على فطرة الاسلام وكلمة الاخلاص ودين نبينا محمد صلى الله عليه وسلم وملة ابينا ابراهيم حنيفا مسلما وما كان من المشركين",
    "اللهم فاطر السماوات والارض عالم الغيب والشهادة رب كل شئ ومليكه أشهد ان لا اله الا انت اعوذ بك من شر نفسي وشر الشيطان وشركه وأن اقترف على نفسي سوءا او اجره الى مسلم",
    "اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا اله الا انت, اللهم اني اعوذ بك من الكفر والفقر وأعوذ بك من عذاب القبر لا اله الا انت",
    "اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
    "حسبي الله لا اله الا هو عليه توكلت وهو رب العرش العظيم",
    "اللهم إني أصبحت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عبدك ورسولك",
    "رضيت بالله ربا وبالاسلام دينا وبمحمد صلى الله عليه وسلم نبيا",
    "لا اله الا الله وحده لا شريك له, له الملك وله الحمد يحيي و يميت وهو على كل شئ قدير",
    "بسم الله الذي لا يضر مع اسمه شئ في الارض ولا في السماء وهو السميع العليم",
    "يا حي يا قيوم، برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
    "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت واليك النشور",
    "اللهم اني اسألك العفو والعافية في الدنيا والاخرة اللهم اني اسألك العفو والعافية في ديني ودنياي وأهلي ومالي, اللهم استر عوراتي وامن روعاتي, اللهم احفظني من بين يدي ومن خلفي وعن يميني  وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي",
    "أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، ربّ أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شرّ ما في هذا اليوم وشرّ ما بعده، ربّ أعوذ بك من الكسل وسوء الكـبـر، ربّ أعوذ بك من عذاب في النار وعذاب في القبر",
    "لا اله الا الله وحده لا شريك له, له الملك وله الحمد وهو على كل شئ قدير",
    "سبحان الله وبحمده ",
    "أستغفر الله العظيم وأتوب اليه",
];

let nightZekr = [
    "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]",
    "قُلۡ هُوَ ٱللَّهُ أَحَدٌ (1) ٱللَّهُ ٱلصَّمَدُ (2) لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (3) وَلَمۡ يَكُن لَّهُۥ كُفُوًا أَحَدُۢ (4)",
    "قُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِي ٱلۡعُقَدِ (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (5)",
    "قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (1) مَلِكِ ٱلنَّاسِ (2) إِلَٰهِ ٱلنَّاسِ (3) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (4) ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ (5) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (6)",
    "أمسينا على فطرة الاسلام وكلمة الاخلاص ودين نبينا محمد صلى الله عليه وسلم وملة ابينا ابراهيم حنيفا مسلما وما كان من المشركين",
    "اللهم فاطر السماوات والارض عالم الغيب والشهادة رب كل شئ ومليكه أشهد ان لا اله الا انت اعوذ بك من شر نفسي وشر الشيطان وشركه وأن اقترف على نفسي سوءا او اجره الى مسلم",
    "اللهم عافني في بدني اللهم عافني في سمعي اللهم عافني في بصري لا اله الا انت, اللهم اني اعوذ بك من الكفر والفقر وأعوذ بك من عذاب القبر لا اله الا انت",
    "اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي وأبوء لك بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت",
    "حسبي الله لا اله الا هو عليه توكلت وهو رب العرش العظيم",
    "اللهم إني أمسيت أشهدك وأشهد حملة عرشك وملائكتك وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عبدك ورسولك",
    "رضيت بالله ربا وبالاسلام دينا وبمحمد صلى الله عليه وسلم نبيا",
    "لا اله الا الله وحده لا شريك له, له الملك وله الحمد يحيي و يميت وهو على كل شئ قدير",
    "بسم الله الذي لا يضر مع اسمه شئ في الارض ولا في السماء وهو السميع العليم",
    "يا حي يا قيوم، برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
    "اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت واليك المصير",
    "اللهم اني اسألك العفو والعافية في الدنيا والاخرة اللهم اني اسألك العفو والعافية في ديني ودنياي وأهلي ومالي, اللهم استر عوراتي وامن روعاتي, اللهم احفظني من بين يدي ومن خلفي وعن يميني  وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي",
    "أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر",
    "لا اله الا الله وحده لا شريك له, له الملك وله الحمد وهو على كل شئ قدير",
    "سبحان الله وبحمده ",
    "أستغفر الله العظيم وأتوب اليه",
];

let dnZekrMain = [1, 3, 3, 3, 1, 1, 3, 1, 7, 4, 1, 10, 3, 1, 1, 1, 1, 100, 100, 100];

let sleepZekr = [
    'يجمع كفيه وينفث فيهما ويقرأ المعوذات:{"قل هو الله أحد", "قل أعوذ برب الفلق", "قل أعوذ برب الناس"}',
    "اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]",
    "اخر آيتين من سورة البقرة ﴿ ءَامَنَ ٱلرَّسُولُ بِمَاۤ أُنزِلَ إِلَیۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَیۡنَ أَحَدࣲ مِّن رُّسُلِهِۦۚ وَقَالُوا۟ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَیۡكَ ٱلۡمَصِیرُ ﴾ ﴿ لَا یُكَلِّفُ ٱللَّهُ نَفۡسًا إِلَّا وُسۡعَهَاۚ لَهَا مَا كَسَبَتۡ وَعَلَیۡهَا مَا ٱكۡتَسَبَتۡۗ رَبَّنَا لَا تُؤَاخِذۡنَاۤ إِن نَّسِینَاۤ أَوۡ أَخۡطَأۡنَاۚ رَبَّنَا وَلَا تَحۡمِلۡ عَلَیۡنَاۤ إِصۡرࣰا كَمَا حَمَلۡتَهُۥ عَلَى ٱلَّذِینَ مِن قَبۡلِنَاۚ رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَاۤۚ أَنتَ مَوۡلَىٰنَا فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ ﴾ [البقرة 285,286]",
    "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت.",
    "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين.",
    "سبحان الله",
    "الحمد لله",
    "الله أكبر",
    "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.",
    "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة",
    "اللهم رب السماوات ورب الأرض ورب العرش العظيم, ربنا ورب كل شيء, فالق الحب والنوى , ومنزل التوراة والانجيل والفرقان, أعوذ بك من شر كل شيء أنت آخذ بناصيته, اللهم أنت الأول فليس قبلك شيء, وأنت اللآخر فليس بعدك شيء, وأنت الظاهر فليس فوقك شيء, وأنت الباطن فليس دونك شيء, اقض عنا الدين وأغننا من الفقر"
];
let sleepZekrMain = [1, 1, 1, 1, 1, 33, 33, 34, 1, 1, 1];
function headerHide() {
    if (headerHidden) {
        header.style.height = header.scrollHeight + 'px';
        headerHidden = false;
    }
    else {
        header.style.height = "80px";
        headerHidden = true;
        
    }
}

listBtn.onclick = function () {
    headerHide();
}

function all(time, numbers) {
    container.innerHTML = '';
    for (let i = 0; i < time.length; i++){
        let box = document.createElement('div');
        container.appendChild(box);
        box.className = 'box';
        let p = document.createElement('p');
        p.innerText = time[i];
        box.appendChild(p);
        let display = document.createElement('div');
        display.className = 'display';
        box.appendChild(display);
        let num = document.createElement('div');
        num.className = 'num';
        num.innerText = 0;
        display.appendChild(num);
        let main = document.createElement('div');
        main.className = 'main';
        main.innerText = numbers[i];
        display.appendChild(main);
        let icon = document.createElement("i");
        icon.className = "fa-solid fa-repeat";
        display.appendChild(icon);
        
    }
}

all(nightZekr, dnZekrMain);

let timeBtns = document.querySelectorAll('ul li');
timeBtns.forEach(function (e,i) {
    e.onclick = function () {
        if (i == 0) {
            all(dayZekr, dnZekrMain);
        }
        else if (i == 1) {
            all(nightZekr, dnZekrMain);
        }
        else if (i == 2){
            all(sleepZekr, sleepZekrMain);
        }
        headerHide();
    }
})

let numBtn = document.querySelectorAll('div.num');
let deleteBtn = document.querySelectorAll("i.fa-repeat");
numBtn.forEach(function (e,i) {
    e.onclick = function () {
        e.innerText =+e.innerText + 1;
    }
})
deleteBtn.forEach(function (e,i) {
    e.onclick = function () {
        numBtn[i].innerText = 0;
    }
})
let dayAndNight = document.querySelector('.head i');
let day = 'true';
if (window.localStorage.getItem('theme')) {
    day = window.localStorage.getItem('theme');
    if (window.localStorage.getItem('theme') == 'false') {
        dayAndNight.className = "fa-solid fa-moon";
        document.body.style.cssText =
          "--counter-background: #31363F; --page-background: #222831;  --font-color: white;";
    }
}

console.log(day)
dayAndNight.onclick = function () {
    if (window.localStorage.getItem("theme")) {
        day = window.localStorage.getItem("theme");
    }
    if (day == 'true') {
        window.localStorage.setItem("theme", false);
        dayAndNight.style.rotate = '360deg';
        dayAndNight.className = 'fa-solid fa-moon';
        document.body.style.cssText =
          "--counter-background: #31363F; --page-background: #222831;  --font-color: white;";
        }
        else {
            window.localStorage.setItem("theme", true);
            dayAndNight.style.rotate = '180deg';
            dayAndNight.className = "fa-solid fa-sun";
            document.body.style.cssText =
                "--counter-background: #5D866C; --page-background: bisque;  --font-color: black;";
            // document.body.style.cssText =
            //     "--counter-background: #31363F; --page-background: #222831;  --font-color: white;";
    }
};